app/views/users/_unfollow.html.erb

<%= form_for current_user.relationships.find_by_followed_id(@user),
:html => { :method => :delete }, :remote => true do |f| %>
---
SELECT `relationships`.* FROM `relationships` WHERE (`relationships`.follower_id = 1) AND (`relationships`.`followed_id` = 2) LIMIT 1