app/controllers/microposts_controller.rb

  def create
    @micropost  = current_user.microposts.build(params[:micropost])
    if @micropost.save
---
INSERT INTO `microposts` (`created_at`, `content`, `user_id`, `updated_at`) VALUES ('2011-01-26 22:55:42', 'Trabajando en carrierwave', 1, '2011-01-26 22:55:42')

  def destroy
      @micropost.destroy
---
DELETE FROM `microposts` WHERE (`microposts`.`id` = 6)