app/controllers/users_controller.rb

  def show
      @user = User.find(params[:id])
      @microposts = @user.microposts.paginate(:page => params[:page])
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT COUNT(*) FROM `microposts` WHERE (`microposts`.user_id = 1)
SELECT `microposts`.* FROM `microposts` WHERE (`microposts`.user_id = 1) ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0

  def index
    @title = "Todos los Usuarios"
    @users = User.paginate(:page => params[:page])
---
SELECT `users`.* FROM `users` LIMIT 30 OFFSET 0

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`updated_at`, `admin`, `salt`, `email`, `name`, `created_at`, `encrypted_password`) VALUES ('2011-01-24 16:55:34', 0, '38f2e86b4a575372ff3705c44e27ad221ff71a9472ea4af174c3fd2173a524d9', 'diana7cris@gmail.com', 'Diana', '2011-01-24 16:55:34', '3f664933de5261ffd1741b2a88289f64b3960ad97f55deb28153a4768bf9d133')

  def edit
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 4) LIMIT 1

  def destroy
      User.find(params[:id]).destroy
---
DELETE FROM `users` WHERE (`users`.`id` = 4)
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 4) LIMIT 1

  def update
      @user = User.find(params[:id])
      if @user.update_attributes(params[:user])
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 6) LIMIT 1
UPDATE `users` SET `apellido` = 'salgado salgado' WHERE (`users`.`id` = 6)

  def following
    @title = "Siguiendo"
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def followers
    @title = "Seguidores"
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1